app/views/collections/index.html.haml

            %td= collection.instructor.try(:name)
            %td= collection.problems.length
---
SELECT "problems".* FROM "problems" INNER JOIN "collections_problems" ON "problems"."id" = "collections_problems"."problem_id" WHERE "collections_problems"."collection_id" = 1