app/views/problems/_collection_buttons.haml

    = form_tag problem_path(:id => problem.id), :method => :put do
      - selected = collection.problems.include? problem
---
SELECT 1 AS one FROM "problems" INNER JOIN "collections_problems" ON "problems"."id" = "collections_problems"."problem_id" WHERE "collections_problems"."collection_id" = 1 AND "problems"."id" = 1 LIMIT 1


- others = problem.collections.select{ |c| can?(:read, c) and cannot?(:manage, c) }
---
SELECT "collections".* FROM "collections" INNER JOIN "collections_problems" ON "collections"."id" = "collections_problems"."collection_id" WHERE "collections_problems"."problem_id" = 1