app/views/problems/_new_form.html.haml

  - source = @ruql_source || (previous && previous.ruql_source) || ''
- tags = (previous && previous.tags.map(&:name).join(', ')) || ''
---
SELECT "tags".* FROM "tags" INNER JOIN "problems_tags" ON "tags"."id" = "problems_tags"."tag_id" WHERE "problems_tags"."problem_id" = 1

        %div.new-problem-collection
          = check_box_tag "collections[#{collection.id}]", 1,  !!(collection.problems.include? previous), class: 'checkbox', id: "collections_#{collection.id}"
---
SELECT "collections".* FROM "collections" INNER JOIN "collections_problems" ON "collections"."id" = "collections_problems"."collection_id" WHERE "collections_problems"."problem_id" = 35
SELECT 1 AS one FROM "problems" INNER JOIN "collections_problems" ON "problems"."id" = "collections_problems"."problem_id" WHERE "collections_problems"."collection_id" = 1 AND "problems"."id" = 8 LIMIT 1