app/views/problems/_problem_data.html.haml

SELECT "problems".* FROM "problems" INNER JOIN "collections_problems" ON "problems"."id" = "collections_problems"."problem_id" WHERE "collections_problems"."collection_id" = 1
---
    -#   - Collection.accessible_by(current_ability, :manage).each do |collection|
    -#     - if collection.problems.include? problem