app/controllers/collections_controller.rb

  def index
    # Show all public collections

    @heading = 'Public collections'
    @instructor = Instructor.find_by_id(@current_user)
---
SELECT "instructors".* FROM "instructors" WHERE "instructors"."id" = 1 LIMIT 1

  def show
    @collection = Collection.find(params[:id])
---
SELECT "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT 1  [["id", "1"]]

  def export
    @collection = Collection.find(params[:id])
---
SELECT "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT 1  [["id", "1"]]

  def finalize_upload
    @collections = params[:ids].map{|collection_id| Collection.find(collection_id)}
---
SELECT "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT 1  [["id", "1"]]