app/controllers/instructors_controller.rb

SELECT "instructors".* FROM "instructors" WHERE "instructors"."id" = 1 LIMIT 1
SELECT "collections".* FROM "collections" WHERE "collections"."instructor_id" = 1
---
  def show
    authorize! :manage, Collection
    @heading = 'Your collections'
    @instructor = Instructor.find_by_id(@current_user)
    @collections = @instructor.collections.to_a