app/controllers/problems_controller.rb

  def set_filters
    session[:filters] = session[:filters].merge params.slice(:search, :tags, :sort_by)

    if session[:filters][:tags].is_a? String
      session[:filters][:tags] = self.class.parse_list session[:filters][:tags]
    end

    session[:filters][:problem_type] = []
    if params[:problem_type]
      params[:problem_type].each do |key, value|
          session[:filters][:problem_type] << key if value == "1"
      end
    end

    session[:filters][:bloom_category] = []
    if params[:bloom_category]
      params[:bloom_category].each do |key, value|
          session[:filters][:bloom_category] << key if value == "1"
      end
    end

    session[:filters][:collections] = []
    if params[:collections]
      params[:collections].each do |key, value|
          session[:filters][:collections] << Integer(key) if value == "1"
      end
    end
    if session[:filters][:collections].include?(0)
---
INSERT INTO "problems" ("bloom_category", "created_at", "created_by", "created_date", "instructor_id", "is_public", "json", "last_used", "obsolete", "previous_version_id", "problem_type", "rendered_text", "text", "uid", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "collections".* FROM "collections" INNER JOIN "collections_problems" ON "collections"."id" = "collections_problems"."collection_id" WHERE "collections_problems"."problem_id" = 34

  def index
    debugger
    if can? :manage, Collection and @current_user.collections
      @collections = @current_user.collections + Collection.where(:access_level => 2) + Collection.where(:access_level => 3)
    else
      @collections = Collection.where(:access_level => 3)
    end
    # @is_student = cannot? :manage Collections
    # debugger
    @problems = Problem.filter(@current_user, session[:filters].clone, Problem.find_by_id(flash[:bump_problem]))
---
SELECT "problems".* FROM "problems" WHERE "problems"."id" IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33)

  def create
    parent_uid = params[:parent_uid]
    if parent_uid
      previous_version = Problem.find_by_uid(params[:parent_uid])
      if !previous_version
        flash[:error] = "Could not find #{params[:parent_uid]}, using default previous question"
      end
    end

    privacy = params[:privacy] ? params[:privacy].strip.downcase : nil
    category = Problem.all_bloom_categories.include?(params[:category]) ? params[:category] : nil
    collections = []
    if params[:collections]
      params[:collections].each do |key, value|
        col = Collection.find(key)
---
SELECT "problems".* FROM "problems" WHERE "problems"."uid" = 'd9df06b7-3edf-48cf-b018-3069d868c8ff' LIMIT 1
SELECT 1 AS one FROM "problems" WHERE ("problems"."uid" = 'e7ce49a8-eff5-4bd0-a8f2-003c768990e0' AND "problems"."id" != 34) LIMIT 1
SELECT "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    problem = Problem.find(params[:id])

    if !params[:privacy].nil?

      authorize! :set_privacy, problem
      privacy = params[:privacy].downcase.strip
      if privacy == 'public'
        # problem.is_public = true
        problem.access_level = 2
      elsif privacy == 'share'
        problem.access_level = 3
      elsif privacy == 'private'
        # problem.is_public = false
        problem.access_level = 1
      else
        return
      end
      problem.save
---
SELECT "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "problems" SET "bloom_category" = 'Remember', "updated_at" = '2016-10-13 05:12:26.688283' WHERE "problems"."id" = 1

      authorize! :bloom_categorize, problem
      category = params[:category].downcase.strip
      category[0] = category[0].upcase
      if Problem.all_bloom_categories.include? category
---
SELECT 1 AS one FROM "problems" WHERE ("problems"."uid" = 'faa7df9c-828b-4787-9757-d4a5ce780288' AND "problems"."id" != 1) LIMIT 1

    end

    if !params[:collection].nil?
      target_collection = Collection.find(params[:collection])
      if !target_collection.problems.include? problem
---
SELECT "collections".* FROM "collections" WHERE "collections"."id" = ? LIMIT 1  [["id", "1"]]
SELECT 1 AS one FROM "problems" INNER JOIN "collections_problems" ON "problems"."id" = "collections_problems"."problem_id" WHERE "collections_problems"."collection_id" = 1 AND "problems"."id" = 13 LIMIT 1

  def supersede
    @problem = Problem.find(params[:id])
---
SELECT "problems".* FROM "problems" WHERE "problems"."id" = ? LIMIT 1  [["id", "8"]]