app/controllers/session_controller.rb

INSERT INTO "instructors" ("created_at", "current_collection", "name", "provider", "provider_email", "provider_image", "uid", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "instructors".* FROM "instructors" WHERE "instructors"."provider" = 'developer' AND "instructors"."uid" IS NULL LIMIT 1
---
  def create
    auth = request.env["omniauth.auth"]
    user = Instructor.find_by_provider_and_uid(auth["provider"],auth["uid"]) ||
      Instructor.create_with_omniauth(auth)